// var idx = lunr(function () {
//   this.use(lunr.ru)
//   this.field('body')

//   this.add({ "body": "Этот текст написан на русском.", "id": 1 });
// })

// results = idx.search("мирный") // Поиск слова "мирный"
// console.log(results)



// var idxEn = lunr(function () {
//   this.field('body');
//   this.add({ "body": "Этот текст написан на русском.", "id": 1 });
//   this.add({ "body": "This text is written in the English language.", "id": 2 });
// });

// var idxRu = lunr(function () {
//   this.use(lunr.ru);
//   this.field('body');
//   this.add({ "body": "Этот текст написан на русском.", "id": 1 });
//   this.add({ "body": "This text is written in the English language.", "id": 2 });
// });

// var idxMulti = lunr(function () {
//   this.use(lunr.multiLanguage('en', 'ru'));
//   this.field('body');
//   this.add({ "body": "Этот текст написан на русском.", "id": 1 });
//   this.add({ "body": "This text is written in the English language.", "id": 2 });
//   this.add({ "body": "мир над головой", "id": 3 });
//   this.add({ "body": "мир над", "id": 4 });
// });

// console.log(idxMulti.search('русских'))
// console.log(idxMulti.search('русском на написан'))
// console.log(idxMulti.search('текст русские'))
// console.log(idxMulti.search('текст'))
// console.log(idxMulti.search('мира было много'))
// console.log(idxMulti.search('languages'))

// Токенизация - это процесс разделения текста на отдельные токены или слова. 
// Стемминг - это процесс приведения слова к его основной или корневой форме

const courses = {
  'Базы данных': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
  'Управление данными': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
  'Защита информации': [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
  'Безопасность информационных технологий и систем': [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
  'Информационная безопасность': [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
  'Инженерная документация': [31, 32, 33, 34, 35, 36, 37, 38, 39, 40],
  'Анализ требований к ИС': [31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 229, 230, 231, 232, 233, 234, 235, 236],
  'Интеллектуальные промышленные технологии': [41, 42, 43, 44, 45, 46, 47],
  'Информатика': [41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56],
  'Основы программирования': [41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 119, 120, 121, 122, 123, 124, 125, 131, 132, 133, 134, 135, 136],
  'Основы проектной деятельности': [41, 42, 43, 44, 45, 46, 47, 119, 120, 121, 122, 123, 124, 125, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 238, 239, 240, 241, 242, 243],
  'Основы системного программного обеспечения': [41, 42, 43, 44, 45, 46, 47, 73, 74, 75, 76, 77, 78, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 148, 149, 150, 151, 152, 153, 154, 155, 156],
  'Системы поддержки принятия решений': [41, 42, 43, 44, 45, 46, 47],
  'Вычислительные методы': [41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 116, 117, 118],
  'Информационные технологии': [41, 42, 43, 44, 45, 46, 47],
  'Методы оптимизации': [41, 42, 43, 44, 45, 46, 47, 116, 117, 118],
  'Теория информационных процессов и систем': [41, 42, 43, 44, 45, 46, 47],
  'Проектирование интеллектуальных информационных систем': [41, 42, 43, 44, 45, 46, 47],
  'Разработка информационно-аналитических систем': [41, 42, 43, 44, 45, 46, 47, 73, 74, 75, 76, 77, 78, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 131, 132, 133, 134, 135, 136],
  'Компьютерное зрение и обработка сигналов': [48, 49, 50, 51, 52, 53, 54, 55, 56, 126, 127, 128, 129, 130, 209],
  'Машинно-зависимые языки': [48, 49, 50, 51, 52, 53, 54, 55, 56],
  'Основы языков программирования': [48, 49, 50, 51, 52, 53, 54, 55, 56, 119, 120, 121, 122, 123, 124, 125],
  'Теория алгоритмов': [48, 49, 50, 51, 52, 53, 54, 55, 56],
  'Информатика и программирование': [48, 49, 50, 51, 52, 53, 54, 55, 56, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105],
  'Стандартизация, сертификация и управление качеством программного обеспечения': [48, 49, 50, 51, 52, 53, 54, 55, 56, 196, 212, 213, 214, 215, 216, 217],
  'Математические основы формальных рассуждений и теория алгоритмов': [48, 49, 50, 51, 52, 53, 54, 55, 56],
  'Основы инженерии знаний': [48, 49, 50, 51, 52, 53, 54, 55, 56],
  'Компьютерная лингвистика': [57, 58, 59, 60, 61, 62, 63, 64, 65, 126, 127, 128, 129, 130],
  'Основы информационной культуры': [57, 58, 59, 60, 61, 62, 63, 64, 65],
  'Информационная культура студента': [57, 58, 59, 60, 61, 62, 63, 64, 65],
  'Киберфизические системы и технологии': [66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78],
  'Системы конструкторского и технологического проектирования': [66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78],
  'Предметно-ориентированные экономические информационные системы': [66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78],
  'Качество и надежность программного обеспечения': [66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 196, 212, 213, 214, 215, 216, 217],
  'Моделирование систем': [73, 74, 75, 76, 77, 78, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125],
  'Технологии программирования': [73, 74, 75, 76, 77, 78, 119, 120, 121, 122, 123, 124, 125, 196, 212, 213, 214, 215, 216, 217, 238, 239, 240, 241, 242, 243],
  'Системы геометрического моделирования': [73, 74, 75, 76, 77, 78],
  'Методы и средства проектирования информационных систем и технологий': [73, 74, 75, 76, 77, 78, 88, 89, 90, 91, 92, 93, 131, 132, 133, 134, 135, 136],
  'Программная инженерия': [73, 74, 75, 76, 77, 78, 119, 120, 121, 122, 123, 124, 125],
  'Проектирование информационных систем': [73, 74, 75, 76, 77, 78],
  'Разработка мобильных приложений': [73, 74, 75, 76, 77, 78, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 131, 132, 133, 134, 135, 136],
  'Объектно-ориентированный анализ и программирование': [73, 74, 75, 76, 77, 78, 119, 120, 121, 122, 123, 124, 125, 131, 132, 133, 134, 135, 136],
  'Основы разработки WEB-приложений': [73, 74, 75, 76, 77, 78],
  'Проектирование человеко-машинного взаимодействия': [73, 74, 75, 76, 77, 78, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 238, 239, 240, 241, 242, 243],
  'Проектная деятельность': [73, 74, 75, 76, 77, 78, 131, 132, 133, 134, 135, 136],
  'Технологии разработки программно-информационных систем': [73, 74, 75, 76, 77, 78, 119, 120, 121, 122, 123, 124, 125, 196, 212, 213, 214, 215, 216, 217, 238, 239, 240, 241, 242, 243],
  'Коммуникация в социальных сетях': [79, 80, 81, 82],
  'Машинное обучение и анализ данных': [79, 80, 81, 82],
  'Нейронные сети': [79, 80, 81, 82, 209, 126, 127, 128, 129, 130],
  'Основы анализа данных': [79, 80, 81, 82],
  'Анализ данных': [79, 80, 81, 82, 116, 117, 118],
  'Введение в машинное обучение': [79, 80, 81, 82, 126, 127, 128, 129, 130],
  'Основы машинного обучения': [79, 80, 81, 82, 126, 127, 128, 129, 130],
  'Компьютерная графика': [83, 84, 85, 86, 87],
  'Мультимедийные и игровые технологии': [83, 84, 85, 86, 87],
  'Машинная графика': [83, 84, 85, 86, 87],
  'Мобильные и встраиваемые технологии': [88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115],
  'Архитектура информационных систем': [88, 89, 90, 91, 92, 93],
  'Операционные системы': [94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105],
  'Администрирование информационных систем': [94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105],
  'Свободное ПО': [94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105],
  'Основы системного анализа и теории управления': [116, 117, 118],
  'Системы компьютерной математики': [116, 117, 118],
  'Моделирование процессов и систем': [116, 117, 118],
  'Дискретная математика': [116, 117, 118],
  'Основы математического моделирования и анализа данных': [116, 117, 118],
  'Разработка приложений с графическим интерфейсом': [119, 120, 121, 122, 123, 124, 125],
  'Информационные системы': [119, 120, 121, 122, 123, 124, 125],
  'Основы процедурных языков программирования': [119, 120, 121, 122, 123, 124, 125, 131, 132, 133, 134, 135, 136],
  'Программирование': [119, 120, 121, 122, 123, 124, 125],
  'Системы искусственного интеллекта': [126, 127, 128, 129, 130],
  'Интеллектуальные информационные системы и технологии': [126, 127, 128, 129, 130],
  'Интеллектуальный анализ данных': [126, 127, 128, 129, 130, 209],
  'Введение в объектно-ориентированное программирование': [131, 132, 133, 134, 135, 136],
  'Введение в объектно-ориентированный анализ': [131, 132, 133, 134, 135, 136],
  'Программирование учетно-ориентированных задач': [131, 132, 133, 134, 135, 136, 179, 180, 181, 182, 183, 184, 185],
  'Управление проектами': [137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 238, 239, 240, 241, 242, 243],
  'Управление ИТ-проектами': [137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 238, 239, 240, 241, 242, 243],
  'Информационные технологии управления проектами': [137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147],
  'WEB-программирование': [148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178],
  'Основы WEB технологий': [148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178],
  'Веб-дизайн': [148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178],
  'Основы разработки WEB-приложений': [148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178],
  'Основы системной инженерии': [179, 180, 181, 182, 183, 184, 185],
  'Управление корпоративной информацией': [179, 180, 181, 182, 183, 184, 185],
  'Параллельные и распределенные вычисления': [186, 187, 188, 189, 190, 191],
  'Тестирование и оценка качества систем искусственного интеллекта': [192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208],
  'Тестирование программного обеспечения': [192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206],
  'Корпоративные информационные системы': [210, 211],
  'Управление ресурсами предприятия в среде 1С_ERP': [210, 211],
  'Программирование в среде 1С': [210, 211],
  'Основы теории систем и системного анализа': [212, 213, 214, 215, 216, 217],
  'Качество и надежность ИС': [196, 212, 213, 214, 215, 216, 217],
  'Распределенный контроль версий кода': [218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228],
  'Разработка и анализ требований к программному обеспечению': [229, 230, 231, 232, 233, 234, 235, 236],
  'Моделирование программного обеспечения': [237],
  'Управление IT-проектами': [137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 238, 239, 240, 241, 242, 243],
  'Основы управления IT-проектами': [137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 238, 239, 240, 241, 242, 243],
  'Технологии обработки информации': [79, 244, 245],
  'Теория графов': [246, 247, 248, 249],
  'Основы технологий быстрого прототипирования': [137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147],
  'Управление киберфизическими системами': [66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78],
  'Анализ больших данных': [79, 82, 62, 63, 245, 250],
  'Архитектура вычислительных систем': [98, 251, 252, 253, 254, 255, 256],
}

const requests = [
  {"id": 1, "request": "архитектура БД" },
  {"id": 2, "request": "архитектура базы данных"},
  {"id": 3, "request": "базы данных"},
  {"id": 4, "request": "база данных"},
  {"id": 5, "request": "MySql"},
  {"id": 6, "request": "бд"},
  {"id": 7, "request": "субд"},
  {"id": 8, "request": "SQLite"},
  {"id": 9, "request": "MongoDb"},
  {"id": 10, "request": "SQL"},
  {"id": 11, "request": "язык запросов"},
  {"id": 12, "request": "нормализация БД"},
  {"id": 13, "request": "нормализация базы данных"},
  {"id": 14, "request": "нормализация данных"},
  {"id": 15, "request": "создание базы данных"},
  {"id": 16, "request": "создание БД"},
  {"id": 17, "request": "сопровождение БД"},
  {"id": 18, "request": "сопровождение базы данных"},
  {"id": 19, "request": "доработка БД"},

  {"id": 20, "request": "принципы безопасности веб приложений"},
  {"id": 21, "request": "принципы безопасности web приложений"},
  {"id": 22, "request": "защита данных"},
  {"id": 23, "request": "защита атак"},
  {"id": 24, "request": "защита взлома"},
  {"id": 25, "request": "защита системы"},
  {"id": 26, "request": "безопасность веб приложения"},
  {"id": 27, "request": "безопасность web приложения"},
  {"id": 28, "request": "защита информации"},
  {"id": 29, "request": "безопасность данных"},
  {"id": 30, "request": "безопасность системы"},

  {"id": 31, "request": "разбираться документация"},
  {"id": 32, "request": "составлять документацию ПО"},
  {"id": 33, "request": "составлять документацию программному обеспечиванию"},
  {"id": 34, "request": "документация программы"},
  {"id": 35, "request": "документация ПО"},
  {"id": 36, "request": "составление документации"},
  {"id": 37, "request": "составление документов"},
  {"id": 38, "request": "формирование документации"},
  {"id": 39, "request": "формирование документов"},
  {"id": 40, "request": "понимание документации"},

  {"id": 41, "request": "решать комплексные задачи"},
  {"id": 42, "request": "решение поставленных задач"},
  {"id": 43, "request": "принятие решений"},
  {"id": 44, "request": "поставленные цели"},
  {"id": 45, "request": "выполнение задач"},
  {"id": 46, "request": "создание собственных решений"},
  {"id": 47, "request": "выполнение сложных задач"},

  {"id": 48, "request": "алгоритмы"},
  {"id": 49, "request": "структура данных"},
  {"id": 50, "request": "алгоритм"},
  {"id": 51, "request": "структуры данных"},
  {"id": 52, "request": "нетривиальные алгоритмы"},
  {"id": 53, "request": "эффективные алгоритмы"},
  {"id": 54, "request": "написание алгоритмов"},
  {"id": 55, "request": "сложность алгоритма"},
  {"id": 56, "request": "оценка сложности алгоритма"},

  {"id": 57, "request": "изучать информацию"},
  {"id": 58, "request": "поиск данных"},
  {"id": 59, "request": "поиск информации"},
  {"id": 60, "request": "анализировать данные"},
  {"id": 61, "request": "разбор данных"},
  {"id": 62, "request": "обрабатывать данные"},
  {"id": 63, "request": "обрабатывать информацию"},
  {"id": 64, "request": "парсинг данных"},
  {"id": 65, "request": "Интернет"},

  {"id": 66, "request": "автоматизация бизнес процессов"},
  {"id": 67, "request": "автоматизация бизнес процесса"},
  {"id": 68, "request": "автоматизация процессов"},
  {"id": 69, "request": "автоматизация задач"},
  {"id": 70, "request": "автоматизация процесса проектирования"},
  {"id": 71, "request": "автоматизация процесса"},
  {"id": 72, "request": "автоматизация задач"},

  {"id": 73, "request": "проектирование системы"},
  {"id": 74, "request": "SOLID"},
  {"id": 75, "request": "шаблоны проектирования"},
  {"id": 76, "request": "принципы проектирования"},
  {"id": 77, "request": "создание модели"},
  {"id": 78, "request": "моделирование"},

  {"id": 79, "request": "анализ данных"},
  {"id": 80, "request": "machine learning"},
  {"id": 81, "request": "машинное обучение"},
  {"id": 82, "request": "Big Data"},

  {"id": 83, "request": "3D моделирование"},
  {"id": 84, "request": "работа графикой"},
  {"id": 85, "request": "компьютерное моделирование"},
  {"id": 85, "request": "компьютерная графика"},
  {"id": 86, "request": "моделирование"},
  {"id": 87, "request": "графика"},

  {"id": 88, "request": "микросервисная архитектура"},
  {"id": 89, "request": "архитектура ПО"},
  {"id": 90, "request": "архитектура системы"},
  {"id": 91, "request": "современная архитектура"},
  {"id": 92, "request": "чистая архитектура"},
  {"id": 93, "request": "архитектура приложения"},

  {"id": 94, "request": "системное администрирование"},
  {"id": 95, "request": "Linux"},
  {"id": 96, "request": "Windows"},
  {"id": 97, "request": "Ubuntu"},
  {"id": 98, "request": "системный администратор"},
  {"id": 99, "request": "ОСИ"},
  {"id": 100, "request": "Shell скрипты"},
  {"id": 101, "request": "командная строка"},
  {"id": 102, "request": "Bash-скрипты"},
  {"id": 103, "request": "операционная система"},
  {"id": 104, "request": "Mac"},
  {"id": 105, "request": "командная строка"},

  {"id": 106, "request": "приложения андроид"},
  {"id": 107, "request": "android разработка"},
  {"id": 108, "request": "создание мобильных приложений"},
  {"id": 109, "request": "мобильные приложения"},
  {"id": 110, "request": "разработка мобильных приложений"},
  {"id": 111, "request": "Kotlin"},
  {"id": 112, "request": "android"},
  {"id": 113, "request": "мобильная разработка"},
  {"id": 114, "request": "мобильное приложение"},
  {"id": 115, "request": "андроид"},

  {"id": 116, "request": "математика"},
  {"id": 117, "request": "линейная алгебра"},
  {"id": 118, "request": "математическй анализ"},

  {"id": 119, "request": "разработка ПО"},
  {"id": 120, "request": "разработка программ"},
  {"id": 121, "request": "разработка программного обеспечения"},
  {"id": 122, "request": "основы программирования"},
  {"id": 123, "request": "основы программной разработки"},
  {"id": 124, "request": "программные средства"},
  {"id": 125, "request": "разбираться чужой код"},

  {"id": 126, "request": "нейронная сеть"},
  {"id": 127, "request": "нейронные сети"},
  {"id": 128, "request": "нейронных сетей"},
  {"id": 129, "request": "искусственный интеллект"},
  {"id": 130, "request": "neuron network"},

  {"id": 131, "request": "библиотеки разработки"},
  {"id": 132, "request": "разработка библиотек"},
  {"id": 133, "request": "ООП"},
  {"id": 134, "request": "функциональное программирование"},
  {"id": 135, "request": "объектно ориентированное программирование"},
  {"id": 136, "request": "паттерны программирования"},

  {"id": 137, "request": "система управления проектами"},
  {"id": 138, "request": "Trello"},
  {"id": 139, "request": "управление командой"},
  {"id": 140, "request": "использование Kanban"},
  {"id": 141, "request": "Kanban доска"},
  {"id": 142, "request": "планирование работы"},
  {"id": 143, "request": "организация работы"},
  {"id": 143, "request": "методология разработки"},
  {"id": 144, "request": "гибкие методологии"},
  {"id": 145, "request": "Agile"},
  {"id": 146, "request": "методология"},
  {"id": 147, "request": "Scrum"},

  {"id": 148, "request": "веб разработка"},
  {"id": 149, "request": "разработка веб приложений"},
  {"id": 150, "request": "разработка клиент серверного приложения"},
  {"id": 151, "request": "веб"},
  {"id": 152, "request": "web"},
  {"id": 153, "request": "web разработка"},
  {"id": 154, "request": "веб приложение"},
  {"id": 155, "request": "web система"},
  {"id": 156, "request": "web приложение"},
  {"id": 157, "request": "HTML"},
  {"id": 158, "request": "CSS"},
  {"id": 159, "request": "JavaScript"},
  {"id": 160, "request": "верстка сайтов"},
  {"id": 161, "request": "фреймворк React"},
  {"id": 162, "request": "framework Django"},
  {"id": 163, "request": "веб программирование"},
  {"id": 164, "request": "архитектура web приложения"},
  {"id": 165, "request": "Frontend"},
  {"id": 166, "request": "архитектура веб приложения"},
  {"id": 167, "request": "Vue"},
  {"id": 168, "request": "React"},
  {"id": 169, "request": "Typescript"},
  {"id": 170, "request": "PHP"},
  {"id": 171, "request": "Laravel"},
  {"id": 172, "request": "программные интерфейсы"},
  {"id": 173, "request": "разработка сайтов"},
  {"id": 174, "request": "JS"},
  {"id": 175, "request": "cms"},
  {"id": 176, "request": "Spring"},
  {"id": 177, "request": "ASP"},
  {"id": 178, "request": "NET"},

  {"id": 179, "request": "Enterprise backend"},
  {"id": 180, "request": "backend"},
  {"id": 181, "request": "бэкэнд"},
  {"id": 182, "request": "развертывание системы"},
  {"id": 183, "request": "Docker"},
  {"id": 184, "request": "deploy"},
  {"id": 185, "request": "диплой"},

  {"id": 186, "request": "параллельное программирование"},
  {"id": 187, "request": "Multithreading"},
  {"id": 188, "request": "asynchronous programming"},
  {"id": 189, "request": "ассинхронное программирование"},
  {"id": 190, "request": "написание ассинхронного кода"},
  {"id": 191, "request": "многопоточность"},

  {"id": 192, "request": "тестирование"},
  {"id": 193, "request": "тестирование ПО"},
  {"id": 194, "request": "тестирование программы"},
  {"id": 195, "request": "тестирование программного обеспечения"},
  {"id": 196, "request": "Обеспечение отказоустойчивости ПО"},
  {"id": 197, "request": "Тестирование приложений"},
  {"id": 198, "request": "отладка"},
  {"id": 199, "request": "отладка ПО"},
  {"id": 200, "request": "отладка программного обеспечения"},
  {"id": 201, "request": "TDD"},
  {"id": 202, "request": "интеграционное тестирование"},
  {"id": 203, "request": "пирамида тестирования"},
  {"id": 204, "request": "юнит тесты"},
  {"id": 205, "request": "тестирование системы"},
  {"id": 206, "request": "системное тестирование"},
  {"id": 207, "request": "тестирование нейронных сетей"},
  {"id": 208, "request": "оценка нейронных сетей"},
  
  {"id": 209, "request": "Object detection"},
  {"id": 210, "request": "1C"},
  {"id": 211, "request": "1с разработка"},

  {"id": 212, "request": "качество ПО"},
  {"id": 213, "request": "качество программы"},
  {"id": 214, "request": "качество системы"},
  {"id": 215, "request": "принципы качественной программы"},
  {"id": 216, "request": "устойчивость системы"},
  {"id": 217, "request": "гибкость системы"},

  {"id": 218, "request": "Git"},
  {"id": 219, "request": "система Git"},
  {"id": 220, "request": "система контроля версий"},
  {"id": 221, "request": "гит"},
  {"id": 222, "request": "GitLab"},
  {"id": 223, "request": "Git Hub"},
  {"id": 224, "request": "git flow"},
  {"id": 225, "request": "контроль версий проекта"},
  {"id": 226, "request": "git"},
  {"id": 227, "request": "git lab"},
  {"id": 228, "request": "гит хаб"},

  {"id": 229, "request": "внедрение системы в эксплуатацию"},
  {"id": 230, "request": "поддержка системы"},
  {"id": 231, "request": "ведение системы"},
  {"id": 232, "request": "ввод системы"},
  {"id": 233, "request": "управление проектом"},
  {"id": 234, "request": "управление системой"},
  {"id": 235, "request": "создавание программных систем"},
  {"id": 236, "request": "сопровождение программных систем"},

  {"id": 237, "request": "диаграмма классов"},

  {"id": 238, "request": "Руководство командой"},
  {"id": 239, "request": "Развитие навыков командной работы"},
  {"id": 240, "request": "работа команде"},
  {"id": 241, "request": "Работа группах над проектом"},
  {"id": 242, "request": "командная разработка"},
  {"id": 243, "request": "групповая разработка"},

  {"id": 244, "request": "визуализация данных"},
  {"id": 245, "request": "обработка данных"},

  {"id": 246, "request": "теория графов"},
  {"id": 247, "request": "графы"},
  {"id": 248, "request": "поиск в графах"},
  {"id": 249, "request": "граф"},

  {"id": 250, "request": "большие данные"},

  {"id": 251, "request": "устройство компьютера"},
  {"id": 252, "request": "устройство ЭВМ"},
  {"id": 253, "request": "ЭВМ"},
  {"id": 254, "request": "составляющие компьютера"},
  {"id": 255, "request": "железо компьтера"},
  {"id": 256, "request": "детали компьютера"},
]

var idxMulti = lunr(function () {
  this.use(lunr.multiLanguage('en', 'ru'));
  this.field('request');
  
  for(let request of requests) {
    this.add(request);
  }

})

const test = 'новые данные'
const listFound = idxMulti.search(test)
// console.log(listFound)

const idsFound = listFound.filter(item => {
  if (Object.keys(item.matchData.metadata).length > 1 || item.score > 2.0) {
    return true
  } else {
    return false
  }
}).map(item => +item.ref)

if (idsFound.length === 0) {
  idsFound = listFound.map(item => +item.ref)
}

// console.log(idsFound)

const coursesFound = new Set([])
for (const key in courses) {
  if (Object.hasOwnProperty.call(courses, key)) {
    const idsCourse = courses[key]
    idsCourse.forEach(id => {
      if (idsFound.includes(id)) {
        coursesFound.add(key)
      }
    })
  }
}

// Необходимо ограничить количество выводимых курсов
// if (coursesFound.size > 8) {
// }

// console.log(coursesFound)



// console.log(idxMulti.search('улучшить знания в нормализации данных'))
// console.log(idxMulti.search('хочу освоить язык написания запросов'))
// console.log(idxMulti.search('хочу освоить Mysql'))

// console.log(idxMulti.search('мира было много'))
// console.log(idxMulti.search('languages'))
// слово защита
// Если было найдено два и больше слов, то выводятся только они. Если было найденно совпадение только с одним словом, то выводится только оно